<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Loop and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.gilburns.pkg.Loop</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Loop</string>
		<key>PKG_ID</key>
		<string>com.github.mrkai77.loop</string>
		<key>PKG_VERSION</key>
		<string>%version%</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.gilburns.download.Loop</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>pkgroot_dirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/%NAME%.app</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/*.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>id</key>
					<string>%PKG_ID%</string>
					<key>install_location</key>
					<string>/</string>
					<key>pkgname</key>
					<string>%NAME%.pkg</string>
					<key>root</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>version</key>
					<string>%PKG_VERSION%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
