<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of PopSQL.

To download Intel use: "x86" in the ARCH_TYPE and "" in DOWNLOAD_URL variable (Blank value)

To Download Apple Silicon use: "arm64" in the ARCH_TYPE and "_arm64" in DOWNLOAD_URL variable (Default value)</string>
	<key>Identifier</key>
	<string>com.github.gilburns.download.PopSQL</string>
	<key>Input</key>
	<dict>
		<key>ARCH_TYPE</key>
		<string>arm64</string>
		<key>DOWNLOAD_URL</key>
		<string>_arm64</string>
		<key>NAME</key>
		<string>PopSQL</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%ARCH_TYPE%.dmg</string>
				<key>url</key>
				<string>https://get.popsql.com/download/dmg%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/PopSQL.app</string>
				<key>requirement</key>
				<string>identifier "org.electron.popsql" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "4TFVQY839W"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/PopSQL.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
