<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.example.installomator-appInDmgInZip</string>
    <key>Description</key>
    <string>Base recipe for processing Installomator labels where the download is a ZIP containing a DMG that contains an APP.</string>
    <key>Input</key>
    <dict>
        <key>LABEL_NAME</key>
        <string>weprint</string>
        <key>local_label_path</key>
        <string>/usr/local/Installomator/labels</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.gilburns.recipes.SharedProcessors/LabelResolver</string>
            <key>Arguments</key>
            <dict>
                <key>label_name</key>
                <string>%LABEL_NAME%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%downloadURL%</string>
                <key>filename</key>
                <string>%name%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/*.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.gilburns.recipes.SharedProcessors/LabelVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>downloaded_file_path</key>
                <string>%found_filename%</string>
                <key>expectedTeamID</key>
                <string>%expectedTeamID%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
