<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Base recipe for processing Installomator labels that result in a DMG download.</string>
    <key>Identifier</key>
    <string>com.example.installomator-dmg</string>
    <key>Input</key>
    <dict>
        <key>LABEL_NAME</key>
        <string>firefox</string>
        <key>local_label_path</key>
        <string>/usr/local/Installomator/labels</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>label_name</key>
                <string>%LABEL_NAME%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.gilburns.recipes.SharedProcessors/LabelResolver</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%name%.dmg</string>
                <key>url</key>
                <string>%downloadURL%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>downloaded_file_path</key>
                <string>%pathname%</string>
                <key>expectedTeamID</key>
                <string>%expectedTeamID%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.gilburns.recipes.SharedProcessors/LabelVerifier</string>
        </dict>
    </array>
</dict>
</plist>
